reddit_clone/app/controllers/users_controller.rb

    def index
        @users = User.all
---
SELECT "users".* FROM "users"

    def show
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "password_digest") VALUES ($1, $2) RETURNING "id"  [["username", "Anthony"], ["password_digest", "$2a$12$oi.ESOdM8lbEmj9gaVRU7Oh86M4xHsa3r9xQGO/zROBSBiXBr/UFC"]]